# running in pc_fwd/src/
read_verilog -sv pc_fwd.sv
read_verilog -sv /Users/alexanderzhang/Documents/classes/minaret/core/../core/wrapper.sv
read_verilog /Users/alexanderzhang/Documents/classes/minaret/core/../core/minaret.v
prep -flatten -nordff -top mfi_testbench

memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
